import pandas as pd
from scipy.stats import chisquare, chi2_contingency

# Задача 14: Проверка равномерности распределения кубика
observed = [97, 98, 109, 95, 97, 104]  # наблюдаемые значения
expected = [100] * 6  # ожидаемые значения при равномерном распределении

chi_stat, p_value = chisquare(f_obs=observed, f_exp=expected)
print("Задача 14: Хи-квадрат тест на равномерность")
print(f"Статистика хи-квадрат: {chi_stat:.4f}")
print(f"p-value: {p_value:.4f}")
if p_value < 0.05:
    print("Распределение НЕ является равномерным (отвергаем H0)")
else:
    print("Нет оснований отвергнуть равномерность (принимаем H0)")

# Задача 15: Проверка зависимости между семейным положением и занятостью
data = pd.DataFrame({
    'Женат': [89, 17, 11, 43, 22, 1],
    'Гражданский брак': [80, 22, 20, 35, 6, 4],
    'Не состоит в отношениях': [35, 44, 35, 6, 8, 22]
})
data.index = ['Полный рабочий день', 'Частичная занятость', 'Временно не работает',
              'На домохозяйстве', 'На пенсии', 'Учёба']

chi2, p, dof, expected = chi2_contingency(data)
print("\nЗадача 15: Хи-квадрат тест на независимость")
print(f"Статистика хи-квадрат: {chi2:.4f}")
print(f"p-value: {p:.4f}")
if p < 0.05:
    print("Семейное положение и занятость ЗАВИСИМЫ (отвергаем H0)")
else:
    print("Нет оснований считать переменные зависимыми (принимаем H0)")
